Repository: pacodinev/cms
Catalog: cms/locale/*/LC_MESSAGES/cms.po
Languages: bg

source: Previous submissions
bg: Предишни решения

source: Right now, you have infinite tokens available on this task.
bg: Сега, вие имате неограничен брой налични жетони за тази задача.

source: Right now, you have one token available on this task.
bg: Сега, вие имате един наличен жетон за тази задача.

source: Right now, you have %(tokens)s tokens available on this task.
bg: Сега, вие имате %(tokens)s налични жетона за тази задача.

source: But you have to wait until %(expiration_time)s to use them.
bg: Вие трябва да изчакате до %(expiration_time)s, за да ги изпозвате.

source: You will receive a new token at %(gen_time)s.
bg: Вие ще получите нов жетон в %(gen_time)s

source: In the current situation, no more tokens will be generated.
bg: В тази ситуация, няма да бъдат генерирани повече жетони.

source: Right now, you do not have tokens available for this task.
bg: Сега, вие нямате налични жетони за тази задача.

source: But you will have to wait until %(expiration_time)s to use it.
bg: Вие трябва да изчакате до %(expiration_time)s, за да го изпозвате.

source: Public score
bg: Публичен резултат

source: Total score
bg: Финален резултат

source: Score
bg: Резултат

source: Official
bg: Официално

source: Token
bg: Жетон

source: no submissions yet
bg: все още няма предадени решения

source: Submission details
bg: Детайли на решениeто

source: Close
bg: Затвори

source: Submit a test
bg: Изпрати тест

source: You can submit %(user_tests_left)s more test(s).
bg: Вие можете да изпратите още %(user_tests_left)s тест(а).

source: input
bg: вход

source: Previous tests
bg: Предишни тестове

source: Input
bg: Вход

source: Output
bg: Изход

source: no tests yet
bg: още няма тестове

source: Test details
bg: Детайли за теста

source: Evaluation outcome
bg: Резултат от оценяването
