Repository: pacodinev/cms
Catalog: cms/locale/*/LC_MESSAGES/cms.po
Languages: bg

source: Compilation succeeded
bg: Успешно компилиране

source: Your submission successfully compiled to an excutable.
bg: Вашето решение успешно се компилира до изпълним файл.

source: Compilation failed
bg: Неуспешно компилиране

source: Your submission did not compile correctly.
bg: Вашето решение не се компилира правилно.

source: Compilation timed out
bg: Превишено време за компилиране

source: Your submission exceeded the time limit while compiling. This might be caused by an excessive use of C++ templates, for example.
bg: Вашето решение превиши времето за компилиране. Това може да бъде причинено от прекомерна употреба на C++ темплейти.

source: Compilation killed with signal %s (could be triggered by violating memory limits)
bg: Компилирането беше прекратено със сигнал %s (вероятно причинено от нарушаване на ограниченията за памет)

source: Your submission was killed with the specified signal. Among other things, this might be caused by exceeding the memory limit for the compilation, and in turn by an excessive use of C++ templates, for example.
bg: Компилирането на вашето решение беше прекратено с указания сигнал. Това може да бъде причинено от превишаване на ограниченията за памет повреме на компилацията, което от своя страна да е резултат от прекомерна употреба на на C++ темплейти.

source: Output is correct
bg: Верен отговор

source: Your submission ran and gave the correct answer
bg: Вашето решение се изпълни и даде верен отговор

source: Output is partially correct
bg: Частично верен отговор

source: Your submission ran and gave the partially correct answer
bg: Вашето решение се изпълни и даде частично верен отговор

source: Output isn't correct
bg: Грешен отговор

source: Your submission ran, but gave the wrong answer
bg: Вашето решение се изпълни, но даде грешен отговор

source: Evaluation didn't produce file %s
bg: Изпълнението не създаде файл %s

source: Your submission ran, but did not write on the correct output file
bg: Вашето решение се изпълни, но не записа в правилния изходен файл

source: Execution timed out
bg: Превишено време за изпълнение

source: Your submission used too much CPU time.
bg: Вашето решение използва твърде много процесорно време.

source: Execution timed out (wall clock limit exceeded)
bg: Превишено време за изпълнение (времевата граница е надвишена)

source: Your submission used too much total time. This might be triggered by undefined code, or buffer overflow, for example. Note that in this case the CPU time visible in the submission details might be much smaller than the time limit.
bg: Вашето решение изпозва твърде много общо време. Това може да бъде причинено от неопределен код или превишаване на лимита на буферите. Ако това е причината, отбележете, че показанто използвано процесорно време в детайлите на решението може да бъде по-малко от лимита за време.

source: Execution killed with signal %d (could be triggered by violating memory limits)
bg: Изпълнението беше прекратено със сигнал %d (вероятно причинено от нарушаване на ограниченията за памет)

source: Your submission was killed with the specified signal. Among other things, this might be caused by exceeding the memory limit. Note that if this is the reason, the memory usage visible in the submission details is the usage before the allocation that caused the signal.
bg: Изпълнението на вашето решение беше прекратено с указания сигнал. Това може да бъде причинено от излизане извън ограниченията за памет. Ако това е причината, отбележете, че показаната използвана памет в детайлите на решението е от преди заделянето на памет, което е предизвикало сигнала.

source: Execution killed because of forbidden syscall %s
bg: Изпълнението беше прекратено поради използването на забранената системна функция %s

source: Your submission was killed because it tried to use the forbidden syscall specified in the message.
bg: Изпълнението на вашата програмата беше прекратено, защото тя се опита да използва забранената системна функция указана в съобщението.

source: Execution killed because of forbidden file access
bg: Изпълнението беше прекратено поради достъп до забранен файл

source: Your submission was killed because it tried to read or write a forbidden file.
bg: Вашето решение беше прекратено заради опит за четене или записване от или в забранен файл.

source: Execution failed because the return code was nonzero
bg: Изпълнението се провали, защото програмата върна ненулев системен код

source: Your submission failed because it exited with a return code different from 0.
bg: Вашето решение се провали, защото върна системен код, различен от 0.

source: N/A
bg: Неизвестно

source: Score details temporarily unavailable.
bg: Някои детайли са временно недостъпни.

source: Subtask %d
bg: Подзадача %d

source: Outcome
bg: Резултат

source: Details
bg: Детайли

source: Execution time
bg: Време за изпълнение

source: Memory used
bg: Използвана памет

source: Not correct
bg: Грешно

source: Correct
bg: Вярно

source: Partially correct
bg: Частично вярно

source: Invalid files in submission
bg: Невалидни файлове в решението

source: Execution completed successfully
bg: Изпълнението завърши успешно

source: No compilation needed
bg: Няма нужда от компилация

source: File not submitted
bg: Файлът не е предаден

source: loading...
bg: зареждане...

source: unknown
bg: неизвестен

source: %d second
bg: %d секунда

source: %d minute
bg: %d минута

source: %d hour
bg: %d час

source: %d day
bg: %d ден

source: %s and %s
bg: %s и %s

source: more than %s
bg: повече от %s

source: contest-token
bg: жетон за цялото състезание

source: contest-tokens
bg: жетона/и(те) за цялото състезание

source: task-token
bg: жетон за определена/та задача

source: task-tokens
bg: жетона/и(те) за определена/та задача

source: token
bg: жетон

source: tokens
bg: жетона/и(те)

source: You don't have %(type_pl)s available for this task.
bg: Вие не разполагате с налични %(type_pl)s за тази задача.

source: You have an infinite number of %(type_pl)s for this task.
bg: Вие разполагате с неограничен брой %(type_pl)s за тази задача.

source: You start with no %(type_pl)s.
bg: Вие започвате без %(type_pl)s.

source: You start with one %(type_s)s.
bg: Вие започвате с един %(type_s)s.

source: Every minute
bg: Всяка минута

source: you get another %(type_s)s,
bg: вие получавате нов %(type_s)s,

source: up to a maximum of one %(type_s)s.
bg: докато достигнете лимита от най-много един %(type_s)s.

source: you get another %(type_s)s.
bg: вие получавате нов %(type_s)s.

source: You don't get other %(type_pl)s.
bg: Вие не получавате нови %(type_pl)s.

source: You can use a %(type_s)s every second
bg: Вие можете да изпозвате %(type_s)s всяка секунда

source: and no more than one %(type_s)s in total.
bg: и не повече от един %(type_s)s общо.

source: You can use a %(type_s)s every second.
bg: Вие можете да изпозвате %(type_s)s всяка секунда.

source: You can use no more than one %(type_s)s in total.
bg: Вие не можете да изпозвате повече от един %(type_s)s общо.

source: You have no limitations on how you use them.
bg: Вие нямате ограничения как да ги изпозвате.

source: Question too big!
bg: Въпросът е твърде голям!

source: You have reached the question length limit.
bg: Вие достигнахте ограничението за дължина на въпроса.

source: Question received
bg: Въпросът е получен

source: Your question has been received, you will be notified when it is answered.
bg: Вашият въпрос беше получен и ще бъдете уведомени, когато имате отговор.

source: Too many print jobs!
bg: Твърде много задачи за принтиране!

source: You have reached the maximum limit of at most %d print jobs.
bg: Вие достагнахте максималния лимит от най-много %d задачи за принтиране.

source: Invalid format!
bg: Невалиден формат!

source: Please select the correct files.
bg: Моля изберете правилните файлове.

source: File too big!
bg: Файлът е твърде голям!

source: Each file must be at most %d bytes long.
bg: Всеки файл трябва да бъде с големина най-много %d байта.

source: Print job storage failed!
bg: Запазването на задачата за принтиране се провали!

source: Please try again.
bg: Моля опитайте отново.

source: Print job received
bg: Задачата за принтиране е получена

source: Your print job has been received.
bg: Вашата задача за принтиране беше получена.

source: You have reached the maximum limit of at most %d submissions among all tasks.
bg: Достигнахте максималния лимит от най-много %d предадени решения по всички задачи.

source: You have reached the maximum limit of at most %d submissions on this task.
bg: Достигнахте максималния лимит от най-много %d предадени решения по тази задача.

source: Too many submissions!
bg: Твърде много предадени решения!

source: Among all tasks, you can submit again after %d seconds from last submission.
bg: Относно всички задачи, вие можете да изпратите решение отново, %d секунди след последното.

source: For this task, you can submit again after %d seconds from last submission.
bg: Относно тази задача, вие можете да изпратите решение отново, %d секунди след последното.

source: Submissions too frequent!
bg: Твърде чести изпращания на решение!

source: Invalid submission format!
bg: Невалиден формат на решението!

source: Invalid archive format!
bg: Невалиден формат на архива!

source: The submitted archive could not be opened.
bg: Изпратеният архив не може да бъде отворен.

source: Cannot recognize the submission language.
bg: Непознат език на решението.

source: Language %s not allowed in this contest.
bg: Езикът %s не се допуска в това състезание.

source: Invalid submission!
bg: Невалидно предадено решение!

source: Submission too big!
bg: Изпратеното решение е твърде голямо!

source: Each source file must be at most %d bytes long.
bg: Всеки файл с код трябва да бъде не по-голям от %d байта.

source: Submission storage failed!
bg: Съхраняването на решението се провали!

source: Submission received
bg: Решението е получено

source: Your submission has been received and is currently being evaluated.
bg: Вашето решение беше получено и се оценява в момента.

source: Compiling...
bg: Компилиране...

source: details
bg: детайли

source: Evaluating...
bg: Тестване...

source: Scoring...
bg: Оценяване...

source: Evaluated
bg: Оценено

source: Token request discarded
bg: Заявката за жетон е отхвърлена

source: Your request has been discarded because you have no tokens available.
bg: Вашата заявка за жетон беше отхвърлена, защото нямате налични жетони.

source: Your request has been discarded because you already used a token on that submission.
bg: Вашата заявка беше отхвърлена, защото вие вече сте използвали жетон на това решение.

source: Token request received
bg: Заявката за жетон е получена

source: Your request has been received and applied to the submission.
bg: Вашата заявка беше получена и приложена върху решението.

source: You have reached the maximum limit of at most %d tests among all tasks.
bg: Достигнахте максималния лимит от най-много %d теста по всички задачи.

source: You have reached the maximum limit of at most %d tests on this task.
bg: Достигнахте максималния лимит от най-много %d теста по тази задача.

source: Too many tests!
bg: Твърде много тестове!

source: Among all tasks, you can test again after %d seconds from last test.
bg: Относно всички задачи, вие можете да направите тест отново, %d секунди след последния тест.

source: For this task, you can test again after %d seconds from last test.
bg: Относно тази задача, вие можете да направите тест отново, %d секунди след последния тест.

source: Tests too frequent!
bg: Твърде често тестване!

source: Invalid test format!
bg: Невалиден формат на теста!

source: Cannot recognize test's language.
bg: Езикът на програмата за тестване не може да бъде разпознат.

source: Invalid test!
bg: Невалиден тест!

source: Test too big!
bg: Програмата за тестване е твърде голяма!

source: Input too big!
bg: Тестовият пример е твърде голям!

source: The input file must be at most %d bytes long.
bg: Входният файл трябва да бъде не по-голям от %d байта.

source: Test storage failed!
bg: Съхраняването на теста се провали!

source: Test received
bg: Тестът е получен

source: Your test has been received and is currently being executed.
bg: Вашият тест беше получен и се изпълнява в момента.

source: Executing...
bg: Изпълняване...

source: Executed
bg: Изпълнено

source: Communication
bg: Комуникация

source: Announcements
bg: Обявления

source: (no subject)
bg: (няма тема)

source: Questions
bg: Въпроси

source: Subject
bg: Тема

source: Text
bg: Текст

source: Ask question
bg: Задай въпрос

source: Reset
bg: Изчисти

source: no answer yet
bg: все още няма отговор

source: Messages
bg: Съобщения

source: Automatic (%s)
bg: Автоматично (%s)

source: Logout
bg: Изход

source: Logged in as <strong>%(first_name)s %(last_name)s</strong> <em>(%(username)s)</em>
bg: Влязохте като <strong>%(first_name)s %(last_name)s</strong> <em>(%(username)s)</em>

source: Failed to log in.
bg: Неуспешно влизане.

source: Welcome
bg: Здравейте

source: Please log in
bg: Моля влезте

source: Username
bg: Потребителско име

source: Password
bg: Парола

source: Login
bg: Вход

source: New message
bg: Ново съобщение

source: New announcement
bg: Ново обявление

source: New answer
bg: Нов отговор

source: %d unread
bg: %d непрочетено/и

source: Until contest starts:
bg: До началото на състезанието:

source: Until contest ends:
bg: До края на състезанието:

source: Until analysis starts:
bg: До началото на анализа:

source: Until analysis ends:
bg: До края на анализа:

source: Time left:
bg: Оставащо време:

source: Server time:
bg: Сървърно време:

source: Overview
bg: Преглед

source: Statement
bg: Условие

source: Submissions
bg: Предадени решения

source: Documentation
bg: Документация

source: Testing
bg: Тестване

source: Printing
bg: Принтиране

source: is released under the
bg: се разпространява под

source: Programming languages and libraries
bg: Програмни езици и библиотеки

source: Standard Template Library
bg: Стандартна библиотека на C++

source: The main Java class of the solution should have exactly the same name as the task.
bg: Главният клас в решенията на джава трябва да има същото име като задачата.

source: Submission details for compilation
bg: Детайли по компилацията на решението

source: Message
bg: Съобщение

source: Explanation
bg: Обяснение

source: Submission details for evaluation
bg: Детайли по оценяването на решението

source: Error %d
bg: Грешка %d

source: An error occured while the server was handling your request.
bg: Възникна грешка, докато сървърът се опитваше да обработи вашата заявка.

source: Note that attempts to tamper with Contest Management System (such as probing the server with customized URLs) may be considered cheating and may lead to disqualification.
bg: Отбележете, че опити за нарушаване работата на състезателната система (например изпращане нестандартни заявки) може да бъде счетено за измама и да доведе до дисквалификация.

source: If you encountered this error during normal usage, please notify the contest administrators.
bg: Ако сте срещнали тази грешка повреме на обичайни действия, моля уведомете системните администратори.

source: General information
bg: Основна информация

source: The contest hasn't started yet.
bg: Състезанието не е започнало още.

source: The contest will start at %(start_time)s and will end at %(stop_time)s.
bg: Състезанието ще започне в %(start_time)s и ще завърши в %(stop_time)s.

source: The contest is currently running.
bg: Състезанието в момента тече.

source: The contest started at %(start_time)s and will end at %(stop_time)s.
bg: Състезанието започна в %(start_time)s и ще завърши в %(stop_time)s.

source: The contest has already ended.
bg: Състезанието вече приключи.

source: The contest started at %(start_time)s and ended at %(stop_time)s.
bg: Състезанието започна в %(start_time)s и завърши в %(stop_time)s.

source: The analysis mode hasn't started yet.
bg: Анализът не е започнал още

source: The analysis mode will start at %(start_time)s and will end at %(stop_time)s.
bg: Анализът ще започне в %(start_time)s и ще завърши в %(stop_time)s.

source: The analysis mode is currently running.
bg: Анализът в момента тече.

source: The analysis mode started at %(start_time)s and will end at %(stop_time)s.
bg: Анализът започна в %(start_time)s и ще завърши в %(stop_time)s.

source: The analysis mode has already ended.
bg: Анализът вече приключи.

source: The analysis mode started at %(start_time)s and ended at %(stop_time)s.
bg: Анализът започна в %(start_time)s и завърши в %(stop_time)s.

source: You have an infinite number of tokens.
bg: Имате безкрайно количество жетони.

source: You can see the detailed result of a submission by using a token on it.
bg: Вие можете да видите подробни резултати от решението като използвате жетон върху него.

source: Your score for each task will be the maximum among the tokened submissions and the last one.
bg: Вашите точки за всяка задача ще бъдат максималните измежду решенията, върху които сте използвали жетон и последното изпратено решение.

source: You have a distinct set of tokens for each task.
bg: Вие имате отделен брой жетони за всяка задача.

source: You can find the rules for the %(type_pl)s on each task's description page.
bg: Вие можете да намерите правилата за използване на %(type_pl)s на страницата с описанието на задачата.

source: You have a set of tokens shared among all tasks.
bg: Вие имате общ брой от жетони за всички задачи.

source: You have two types of tokens: a set of <em>contest-tokens</em> shared among all tasks and a distinct set of <em>task-tokens</em> for each task.
bg: Вие имате два вида жетони: някои от тях <em>жетони за цялото състезание</em> можете да използвате върху всички задачи и отделен брой <em>жетони за всяка задача</em>, които можете да използвате само върху съответната задача, за която са предназначени.

source: You can see the detailed result of a submission by using two tokens on it, one of each type.
bg: Вие можете да видите подробни резултати от решението, като използвате два жетона върху него, по един от всеки вид.

source: You can submit at most %(submissions)s solutions during this contest.
bg: Вие можете да изпратите най-много %(submissions)s решениe(я) повреме на това състезание.

source: You can submit at most %(user_tests)s user tests during this contest.
bg: Вие можете да изпратите най-много %(user_tests)s тест(а) повреме на това състезание.

source: Every user is allowed to compete (i.e. submit solutions) for a uninterrupted time frame of %(per_user_time)s.
bg: На всеки състезател е позволено да се състезава (да изпраща решения) за непрекъснат времеви интервал от %(per_user_time)s.

source: As soon as the contest starts you can choose to start your time frame.
bg: Когато състезанието започне, вие можете да изберете да започнете вашия интервал от време.

source: Once you start, you can submit solutions until the end of the time frame or until the end of the contest, whatever comes first.
bg: Когато започнете състезанието, вие можете да изпращате решения до края на вашия интервал от време или до края на състезанието, което се случи първо.

source: By clicking on the button below you can start your time frame.
bg: С кликването на бутона отдолу вие можете започнете вашия интервал от време.

source: You started your time frame at %(start_time)s.
bg: Вие започнахте вашия интервал от време в %(start_time)s.

source: You can submit solutions until the end of the time frame or until the end of the contest, whatever comes first.
bg: Вие можете да изпращате решения до края на вашия интервал от време или до края на състезанието, което се случи първо.

source: You started your time frame at %(start_time)s and you already finished it.
bg: Вие започнахте вашия интервал от време в %(start_time)s и той вече приключи.

source: There's nothing you can do now.
bg: Вие не можете да направите нищо в момента.

source: You never started your time frame. Now it's too late.
bg: Вие така и не започнахте вашия интервал от време. Сега е твърде късно.

source: Start!
bg: Започни!

source: Task overview
bg: Преглед на задачите

source: Task
bg: Задача

source: Name
bg: Име

source: Time limit
bg: Времеви лимит

source: Memory limit
bg: Ограничение за памет

source: Type
bg: Тип

source: Files
bg: Файлове

source: Tokens
bg: Жетони

source: {seconds:g} second
bg: {seconds:g} секунда

source: {seconds:g} seconds
bg: {seconds:g} секунди

source: %(mb)d MiB
bg: %(mb)d МiB

source: Yes
bg: Да

source: No
bg: Не

source: Print
bg: Принтирай

source: You can print %(remaining_jobs)d more text or PDF files of up to %(max_pages)d pages each.
bg: Вие можете да принтирате още %(remaining_jobs)d текстов(и) или PDF файл(ове) с най-много %(max_pages)d страница/и всеки.

source: You can print %(remaining_jobs)d more text files of up to %(max_pages)d pages each.
bg: Вие можете да принтирате още %(remaining_jobs)d текстов(и) файл(oве) с най-много %(max_pages)d страница/и всеки.

source: File (text or PDF)
bg: Файл (текстов или PDF)

source: File (text)
bg: Файл (текстов)

source: Submit
bg: Изпрати

source: You cannot print anything any more as you have used up your printing quota.
bg: Вие не можете да принтирате нищо повече, защото вече сте изпозвали вашата квота за принтиране.

source: Previous print jobs
bg: Предишни задачи за принтиране

source: Date and time
bg: Дата и час

source: Time
bg: Време

source: File name
bg: Име на файла

source: Status
bg: Статус

source: no print jobs yet
bg: все още няма задачи за принтиране

source: Preparing...
bg: Подготовка...

source: Compilation output
bg: Изход от компилирането

source: Compilation outcome:
bg: Резултат от компилирането:

source: Compilation time:
bg: Време за компилиране:

source: Memory used:
bg: Използвана памет:

source: Standard output
bg: Стандартен изход

source: Standard error
bg: Стандартна грешка

source: None
bg: Нищо

source: Download
bg: Изтегли

source: Played
bg: Изиграно

source: Play!
bg: Играй!

source: Wait...
bg: Изчакай...

source: No tokens
bg: Няма жетони

source: %(name)s (%(short_name)s) <small>description</small>
bg: %(name)s (%(short_name)s) <small>описание</small>

source: no statement available
bg: няма налично условие

source: Download task statement
bg: Изтегли условието на задачата

source: The statement for this task is available in multiple versions, in different languages.
bg: Условието на тази задача е налично в множество версии на различни езици.

source: You can see (and download) all of them using the list on the right.
bg: Вие можете да видите (и свалите) всяко от тях, използвайки списъка вдясно.

source: Some suggested translations follow.
bg: Следват някои препоръчани преводи.

source: Statement in <b>%s</b>
bg: Условие на <b>%s</b>

source: Statement in %s
bg: Условие на %s

source: Some details
bg: Някои детайли

source: Compilation commands
bg: Команди за компилиране

source: You can find the rules for the %(type_pl)s on the <a href="%(contest_root)s">contest overview page</a>.
bg: Вие можете да намерите правилата за изпозване на %(type_pl)s на <a href="%(contest_root)s">страницата с описанието на състезанието</a>.

source: Remeber that to see the detailed result of a submission you need to use both a contest-token and a task-token.
bg: Не забравяйте, че за да видите подробните резултати от решението, вие трябва да изпозвате и от двата вида жетони - тези за цялото състезание и тези за конкретната задача.

source: Attachments
bg: Прикачени файлове

source: %(name)s (%(short_name)s) <small>submissions</small>
bg: %(name)s (%(short_name)s) <small>предадени решения</small>

source: Submit a solution
bg: Предай решение

source: You can submit %(submissions_left)s more solution(s).
bg: Вие можете да предадете още %(submissions_left)s решениe(я).
